-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: localhost    Database: BarBer
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Category`
--


CREATE DATABASE IF NOT EXISTS BarBer;
USE BarBer;


DROP TABLE IF EXISTS `Category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Category` (
  `IdCategory` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(100) NOT NULL,
  PRIMARY KEY (`IdCategory`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Category`
--

LOCK TABLES `Category` WRITE;
/*!40000 ALTER TABLE `Category` DISABLE KEYS */;
INSERT INTO `Category` VALUES (1,'Услуги по уходу за волосами на голове'),(2,'Услуги по уходу за бородой и усами'),(3,'Косметические и уходовые процедуры'),(4,'Дополнительные мужские услуги');
/*!40000 ALTER TABLE `Category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Client`
--

DROP TABLE IF EXISTS `Client`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Client` (
  `IdClient` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(50) NOT NULL,
  `Surname` varchar(50) NOT NULL,
  `Patronymic` varchar(50) DEFAULT NULL,
  `Phone` varchar(11) NOT NULL,
  PRIMARY KEY (`IdClient`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Client`
--

LOCK TABLES `Client` WRITE;
/*!40000 ALTER TABLE `Client` DISABLE KEYS */;
INSERT INTO `Client` VALUES (1,'Ксения','Дмитриева','Сергеевна','79189012345'),(2,'Павел','Белов','Александрович','79190123456'),(3,'Вероника','Крылова','Максимовна','79201234567'),(4,'Виктор','Романов','Борисович','79301234568'),(5,'Людмила','Щербакова','Васильевна','79402345679'),(6,'Александр','Кириллов','Петрович','79503456780'),(7,'Евгения','Соколова','Олеговна','79604567891'),(8,'Михаил','Павлов','Денисович','79705678902'),(9,'Дарья','Николаева','Артёмовна','79806789019'),(10,'Денис','Фролов','Сергеевич','79907890124'),(11,'Анна','Виноградова','Геннадьевна','79008901235'),(12,'Григорий','Морозов','Константинович','79109012346'),(13,'Оксана','Гусева','Евгеньевна','79210123457'),(14,'Вячеслав','Кузнецов','Михайлович','79311234568'),(15,'Тамара','Петрова','Валерьевна','79412345679'),(16,'Кирилл','Лебедев','Викторович','79513456780'),(17,'Алина','Михайлова','Юрьевна','79614567891'),(18,'Василий','Иванов','Алексеевич','79715678902'),(19,'Екатерина','Федорова','Дмитриевна','79816789013'),(20,'Юрий','Григорьев','Олегович','79917890124'),(21,'Лариса','Морозова','Николаевна','79018901235'),(22,'Петр','Борисов','Васильевич','79119012346'),(23,'Валерия','Ковалёва','Павловна','79220123457'),(24,'Никита','Яковлев','Геннадьевич','79321234568'),(25,'Илья','Гусев','Валерьевич','79422345679'),(26,'Марина','Дмитриева','Анатольевна','79523456780'),(27,'Степан','Белов','Фёдорович','79624567891'),(28,'Карина','Крылова','Сергеевна','79725678902'),(29,'Леонид','Романов','Владимирович','79826789013'),(30,'Алеся','Щербакова','Дмитриевна','79927890124'),(31,'Марат','Кириллов','Львович','79028901235'),(32,'Галина','Соколова','Борисовна','79129012346'),(33,'Иван','Петров','Максимович','79230123457'),(34,'Нина','Морозова','Васильевна','79331234568'),(35,'Дмитрий','Белов','Олегович','79432345679'),(36,'Елена','Крылова','Григорьевна','79533456780'),(37,'Роман','Романов','Аркадьевич','79634567891'),(38,'Татьяна','Щербакова','Фёдоровна','79735678902'),(39,'Максим','Кириллов','Вячеславович','79836789013'),(40,'Ольга','Соколова','Юрьевна','79937890124'),(41,'Андрей','Павлов','Николаевич','79038901235'),(42,'Вероника','Николаева','Романовна','79139012346'),(43,'Игорь','Фролов','Павлович','79240123457'),(44,'Ксения','Виноградова','Игоревна','79341234568'),(45,'Павел','Ковалёв','Денисович','79442345679'),(46,'Людмила','Яковлева','Михайловна','79543456780'),(47,'Алексей','Гусев','Анатольевич','79644567891'),(48,'Евгения','Дмитриева','Викторовна','79745678902'),(50,'Борис','Пятницкий','Юрьевич','79018000882');
/*!40000 ALTER TABLE `Client` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Employe`
--

DROP TABLE IF EXISTS `Employe`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Employe` (
  `IdEmploye` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(50) NOT NULL,
  `Surname` varchar(50) NOT NULL,
  `Patronymic` varchar(50) DEFAULT NULL,
  `Phone` varchar(11) NOT NULL,
  `Birthday` date NOT NULL,
  `Id_Post` int NOT NULL,
  `Photo` text NOT NULL,
  PRIMARY KEY (`IdEmploye`),
  KEY `Id_Post_idx` (`Id_Post`),
  CONSTRAINT `Id_Post` FOREIGN KEY (`Id_Post`) REFERENCES `Post` (`IdPost`)
) ENGINE=InnoDB AUTO_INCREMENT=56 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Employe`
--

LOCK TABLES `Employe` WRITE;
/*!40000 ALTER TABLE `Employe` DISABLE KEYS */;
INSERT INTO `Employe` VALUES (1,'Иван','Иванов','Иванович','79123456789','1990-01-01',1,''),(2,'Елена','Петрова','Сергеевна','79234567890','1985-05-15',1,''),(3,'Сергей','Смирнов','Александрович','79345678901','1978-12-25',1,''),(4,'Анна','Васильева','Павловна','79456789012','1995-03-10',1,''),(5,'Дмитрий','Попов','Николаевич','79567890123','1982-09-05',1,''),(6,'Ольга','Кузьмина','Владимировна','79678901234','1992-07-20',1,''),(7,'Александр','Новиков','Анатольевич','79789012345','1980-11-30',1,''),(8,'Марина','Левина','Геннадьевна','79890123456','1998-04-12',1,''),(9,'Алексей','Борисов','Викторович','79901234567','1975-06-18',1,''),(10,'Наталья','Романова','Леонидовна','79012345678','1987-02-28',1,''),(11,'Михаил','Андреев','Константинович','79123456780','1991-08-14',2,''),(12,'Светлана','Орлова','Юрьевна','79234567891','1983-10-03',2,''),(13,'Андрей','Зотов','Артёмович','79345678902','1979-01-22',2,''),(14,'Дарья','Кириллова','Денисовна','79456789013','1996-05-09',2,''),(15,'Максим','Королев','Антонович','79567890124','1986-12-17',2,''),(16,'Юлия','Комарова','Станиславовна','79678901235','1993-07-01',2,''),(17,'Владимир','Миронов','Георгиевич','79789012346','1981-03-29',2,''),(18,'Татьяна','Ершова','Владимировна','79890123457','1999-11-11',2,''),(19,'Николай','Волков','Игоревич','79901234568','1976-06-24',2,''),(20,'Лилия','Макарова','Романовна','79012345679','1988-02-16',2,''),(21,'Евгений','Демидов','Семёнович','79123456781','1994-09-07',2,''),(22,'Людмила','Степанова','Аркадьевна','79234567892','1984-04-21',2,''),(23,'Павел','Матвеев','Дмитриевич','79345678903','1977-10-13',2,''),(24,'Алёна','Чехова','Леонидовна','79456789014','1997-01-06',2,''),(25,'Борис','Шестаков','Вячеславович','79567890125','1989-08-19',2,''),(26,'Галина','Соловьева','Евгеньевна','79678901236','1990-05-27',2,''),(27,'Роман','Абрамов','Игнатьевич','79789012347','1982-12-08',2,''),(28,'Тамара','Тихонова','Васильевна','79890123458','1993-03-14',2,''),(29,'Кирилл','Пронин','Давыдович','79901234569','1987-07-02',2,''),(30,'Инна','Федорова','Геннадьевна','79012345670','1991-11-23',2,''),(31,'Денис','Быстров','Никитич','79123456782','1975-06-10',2,''),(32,'Жанна','Краснова','Анфимовна','79234567893','1996-02-20',2,''),(33,'Станислав','Колосов','Трофимович','79345678904','1985-09-15',2,''),(34,'Виктория','Симакова','Руслановна','79456789015','1992-04-05',2,''),(35,'Константин','Гордеев','Владленович','79567890126','1979-10-30',2,''),(36,'Ангелина','Разумовская','Петровна','79678901237','1998-01-18',2,''),(37,'Виталий','Карпов','Леонтиевич','79789012348','1983-08-04',2,''),(38,'Любовь','Маслова','Геннадьевна','79890123459','1994-12-22',2,''),(39,'Антон','Толмачев','Владимирович','79901234560','1980-03-11',3,''),(40,'Оксана','Перова','Ильинична','79012345671','1999-06-17',3,''),(41,'Игорь','Русаков','Самуилович','79123456783','1976-11-29',3,''),(42,'Полина','Чернышёва','Евсеевна','79234567894','1995-02-09',3,''),(43,'Ростислав','Сафронов','Филиппович','79345678905','1986-07-25',3,''),(44,'Раиса','Казакова','Адольфовна','79456789016','1997-05-13',3,''),(45,'Богдан','Фокин','Витальевич','79567890127','1981-10-06',3,''),(46,'Елизавета','Цветкова','Леонидовна','79678901238','1992-01-21',3,''),(47,'Алина','Бирюкова','Родионовна','79789012349','1988-09-16',3,''),(48,'Леонид','Голубев','Августович','79890123450','1993-04-08',3,''),(49,'Диана','Фомина','Робертовна','79901234561','1984-12-30',2,'49_ДианаФ.Р.png'),(51,'Сергей','Пятницкий','Юрьевич','79018000882','2006-05-22',1,''),(53,'Неборис','Пятницкий','Юрьевич','79018000880','2006-05-22',1,' ');
/*!40000 ALTER TABLE `Employe` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Payment`
--

DROP TABLE IF EXISTS `Payment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Payment` (
  `IdPayment` int NOT NULL AUTO_INCREMENT,
  `Id_Record` int NOT NULL,
  `Payment_Time` datetime NOT NULL,
  `Amount` decimal(19,2) NOT NULL,
  `Discount` decimal(19,2) NOT NULL,
  PRIMARY KEY (`IdPayment`),
  KEY `Id_Record_idx` (`Id_Record`),
  CONSTRAINT `Id_Record` FOREIGN KEY (`Id_Record`) REFERENCES `Record` (`IdRecord`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Payment`
--

LOCK TABLES `Payment` WRITE;
/*!40000 ALTER TABLE `Payment` DISABLE KEYS */;
INSERT INTO `Payment` VALUES (1,1,'2026-06-13 11:53:35',3000.00,450.00),(2,2,'2026-06-13 11:53:39',6300.00,945.00),(3,3,'2026-06-13 11:53:43',1500.00,0.00),(4,4,'2026-06-13 11:53:46',3500.00,525.00),(5,10,'2026-06-13 11:53:50',2700.00,405.00),(6,9,'2026-06-13 11:53:57',3400.00,510.00),(7,7,'2026-06-13 11:54:22',2900.00,435.00),(8,5,'2026-06-13 11:54:26',1900.00,0.00),(9,6,'2026-06-13 11:54:30',1600.00,0.00),(10,8,'2026-06-13 11:54:35',4700.00,705.00),(11,11,'2026-06-13 14:53:23',2300.00,345.00),(12,12,'2026-06-13 14:53:27',2450.00,367.00),(13,13,'2026-06-13 14:53:30',3000.00,450.00),(14,14,'2026-06-13 14:53:33',1200.00,0.00),(15,15,'2026-06-13 14:53:36',2900.00,435.00),(16,16,'2026-06-13 14:53:39',2500.00,375.00),(17,18,'2026-06-13 14:53:43',6000.00,900.00),(18,17,'2026-06-13 14:53:46',1800.00,0.00),(19,20,'2026-06-13 14:53:49',2700.00,405.00),(20,19,'2026-06-13 14:53:52',4700.00,705.00),(21,21,'2026-06-13 14:53:57',1600.00,0.00),(22,22,'2026-06-13 14:54:00',900.00,0.00),(23,23,'2026-06-13 14:54:03',4800.00,720.00),(24,24,'2026-06-13 14:54:07',1300.00,0.00),(25,25,'2026-06-13 14:54:09',1300.00,0.00),(26,26,'2026-06-13 14:54:13',5300.00,795.00),(27,27,'2026-06-13 14:54:16',1900.00,0.00),(28,28,'2026-06-13 14:54:18',3500.00,525.00),(29,29,'2026-06-13 14:54:26',2300.00,345.00),(30,30,'2026-06-13 14:54:29',7900.00,1185.00),(31,31,'2026-06-13 14:54:33',3000.00,450.00),(32,32,'2026-06-13 14:54:35',1900.00,0.00),(33,33,'2026-06-13 14:54:38',1700.00,0.00),(34,34,'2026-06-13 14:54:40',2200.00,330.00),(35,35,'2026-06-13 14:54:43',2900.00,435.00),(36,36,'2026-06-13 14:54:47',1500.00,0.00),(37,37,'2026-06-13 14:54:49',3100.00,465.00),(38,38,'2026-06-13 14:54:53',4200.00,630.00),(39,40,'2026-06-13 14:54:56',1500.00,0.00),(40,39,'2026-06-13 14:55:01',3400.00,510.00),(41,41,'2026-06-13 14:55:06',3100.00,465.00),(42,42,'2026-06-13 14:55:08',3400.00,510.00),(43,43,'2026-06-13 14:55:11',3600.00,540.00),(44,44,'2026-06-13 14:55:13',1600.00,0.00),(45,45,'2026-06-13 14:55:16',4800.00,720.00);
/*!40000 ALTER TABLE `Payment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Post`
--

DROP TABLE IF EXISTS `Post`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Post` (
  `IdPost` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(45) NOT NULL,
  `BarberPost` int NOT NULL,
  PRIMARY KEY (`IdPost`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Post`
--

LOCK TABLES `Post` WRITE;
/*!40000 ALTER TABLE `Post` DISABLE KEYS */;
INSERT INTO `Post` VALUES (1,'Администрация',0),(2,'Барбер',1),(3,'Менеджер',0);
/*!40000 ALTER TABLE `Post` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Record`
--

DROP TABLE IF EXISTS `Record`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Record` (
  `IdRecord` int NOT NULL AUTO_INCREMENT,
  `Id_Client` int NOT NULL,
  `Id_Employe` int NOT NULL,
  `Id_Status` int NOT NULL,
  `Date_Record` date NOT NULL,
  `Time_Record` time NOT NULL,
  `Totla_Price` decimal(19,2) NOT NULL,
  `Total_Time` varchar(3) NOT NULL,
  PRIMARY KEY (`IdRecord`),
  KEY `Id_Client_idx` (`Id_Client`),
  KEY `Id_Employe_idx` (`Id_Employe`),
  KEY `Id_Status_idx` (`Id_Status`),
  CONSTRAINT `Id_Client` FOREIGN KEY (`Id_Client`) REFERENCES `Client` (`IdClient`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `Id_Employe` FOREIGN KEY (`Id_Employe`) REFERENCES `Employe` (`IdEmploye`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `Id_Status` FOREIGN KEY (`Id_Status`) REFERENCES `Status` (`IdStatus`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Record`
--

LOCK TABLES `Record` WRITE;
/*!40000 ALTER TABLE `Record` DISABLE KEYS */;
INSERT INTO `Record` VALUES (1,3,49,2,'2026-06-12','09:00:00',3000.00,'105'),(2,47,49,2,'2026-06-13','11:30:00',6300.00,'195'),(3,3,15,2,'2026-06-13','11:00:00',1500.00,'60'),(4,20,36,2,'2026-06-13','14:00:00',3500.00,'125'),(5,2,25,2,'2026-06-13','11:00:00',1900.00,'65'),(6,2,49,2,'2026-06-13','09:00:00',1600.00,'60'),(7,3,15,2,'2026-06-13','13:30:00',2900.00,'100'),(8,20,17,2,'2026-06-13','09:00:00',4700.00,'170'),(9,2,13,2,'2026-06-13','09:00:00',3400.00,'115'),(10,24,31,2,'2026-06-13','09:30:00',2700.00,'80'),(11,29,12,2,'2026-06-13','09:00:00',2300.00,'80'),(12,27,13,2,'2026-06-13','11:30:00',2450.00,'85'),(13,24,31,2,'2026-06-13','13:30:00',3000.00,'110'),(14,28,25,2,'2026-06-13','09:00:00',1200.00,'45'),(15,25,49,2,'2026-06-13','15:00:00',2900.00,'105'),(16,4,15,2,'2026-06-13','15:30:00',2500.00,'90'),(17,27,11,2,'2026-06-14','09:00:00',1800.00,'60'),(18,5,12,2,'2026-06-14','11:00:00',6000.00,'200'),(19,4,49,2,'2026-06-14','09:00:00',4700.00,'150'),(20,7,35,2,'2026-06-14','11:00:00',2700.00,'95'),(21,4,13,2,'2026-06-14','11:00:00',1600.00,'60'),(22,2,13,2,'2026-06-14','09:00:00',900.00,'30'),(23,28,49,2,'2026-06-14','13:30:00',4800.00,'155'),(24,47,36,2,'2026-06-14','20:00:00',1300.00,'50'),(25,4,38,2,'2026-06-14','09:00:00',1300.00,'45'),(26,4,34,2,'2026-06-14','09:00:00',5300.00,'170'),(27,2,11,2,'2026-06-15','09:00:00',1900.00,'70'),(28,16,20,2,'2026-06-15','09:00:00',3500.00,'110'),(29,24,21,2,'2026-06-15','09:00:00',2300.00,'80'),(30,15,29,2,'2026-06-15','09:00:00',7900.00,'280'),(31,36,14,2,'2026-06-16','11:30:00',3000.00,'110'),(32,25,37,2,'2026-06-16','09:00:00',1900.00,'60'),(33,39,49,2,'2026-06-16','09:00:00',1700.00,'65'),(34,46,36,2,'2026-06-16','09:00:00',2200.00,'80'),(35,47,34,2,'2026-06-16','09:00:00',2900.00,'95'),(36,21,28,2,'2026-06-16','15:30:00',1500.00,'55'),(37,25,38,2,'2026-06-16','13:00:00',3100.00,'110'),(38,26,49,2,'2026-06-17','09:00:00',4200.00,'145'),(39,23,30,2,'2026-06-17','11:00:00',3400.00,'125'),(40,27,13,2,'2026-06-17','13:00:00',1500.00,'55'),(41,47,38,2,'2026-06-17','11:00:00',3100.00,'100'),(42,50,49,2,'2026-06-17','11:30:00',3400.00,'120'),(43,26,49,2,'2026-06-17','14:00:00',3600.00,'130'),(44,44,33,2,'2026-06-17','11:00:00',1600.00,'60'),(45,29,12,2,'2026-06-17','18:00:00',4800.00,'170');
/*!40000 ALTER TABLE `Record` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Role`
--

DROP TABLE IF EXISTS `Role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Role` (
  `IdRole` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(20) NOT NULL,
  PRIMARY KEY (`IdRole`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Role`
--

LOCK TABLES `Role` WRITE;
/*!40000 ALTER TABLE `Role` DISABLE KEYS */;
INSERT INTO `Role` VALUES (1,'Администратор'),(2,'Менеджер'),(3,'Мастер');
/*!40000 ALTER TABLE `Role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Service`
--

DROP TABLE IF EXISTS `Service`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Service` (
  `IdService` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(50) NOT NULL,
  `Description` varchar(200) DEFAULT NULL,
  `Id_Category` int NOT NULL,
  `Cost` decimal(19,2) NOT NULL,
  `Duration` int NOT NULL,
  PRIMARY KEY (`IdService`),
  KEY `Id_Category_idx` (`Id_Category`),
  CONSTRAINT `Id_Category` FOREIGN KEY (`Id_Category`) REFERENCES `Category` (`IdCategory`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Service`
--

LOCK TABLES `Service` WRITE;
/*!40000 ALTER TABLE `Service` DISABLE KEYS */;
INSERT INTO `Service` VALUES (1,'Классическая мужская стрижка','Профессиональная стрижка с учётом индивидуальных особенностей лица и структуры волос. Включает мытьё головы, сушку и укладку.',1,1500.00,60),(2,'Стрижка машинкой (бокс/полубокс)','Аккуратная стрижка машинкой с чёткими контурами и окантовкой. Подходит для коротких волос, выполняется без сложных укладок.',1,1000.00,40),(3,'Укладка волос со стайлингом','Создание стильной укладки с использованием профессиональных средств (воск, помада, гель). Подчёркивает форму стрижки и придаёт завершённый вид.',1,500.00,20),(4,'Мытьё головы с маской','Глубокое очищение волос шампунем и нанесение питательной маски. Устраняет сухость, придаёт блеск и облегчает укладку.',1,400.00,15),(5,'Окрашивание волос (полное)','Равномерное окрашивание волос в выбранный оттенок с использованием профессиональной краски. Позволяет освежить образ или скрыть седину.',1,2500.00,90),(6,'Камуфляж седины','Точечное тонирование седых волос в натуральный оттенок без изменения общего цвета. Эффект держится 4–6 недель.',1,1800.00,45),(7,'Детская стрижка (до 14 лет)','Безопасная стрижка для мальчиков с учётом детской структуры волос. Выполняется аккуратно, с минимизацией стресса для ребёнка.',1,800.00,30),(8,'Стрижка под насадку','Стрижка машинкой с использованием насадок разной длины (3–12 мм). Быстрый и практичный вариант для поддержания формы.',1,700.00,25),(9,'Фэйд (fade) с плавным переходом','Создание плавного перехода от коротких волос к длинным с эффектом «растаявших» контуров. Требует высокой точности.',1,1700.00,50),(10,'Кроп-стрижка','Современная стрижка с объёмом на макушке и короткими боками. Подходит для прямых или слегка вьющихся волос.',1,1600.00,55),(11,'Британка','Классическая стрижка с удлинённой чёлкой и объёмом на макушке. Требует регулярной укладки.',1,1650.00,55),(12,'Канадка','Стрижка с объёмом на лбу и макушке, укороченными висками и затылком. Подходит для густых волос.',1,1700.00,60),(13,'Топ-нот','Стрижка с удлинённой макушкой, собранной в пучок, и очень короткими висками/затылком. Креативный вариант.',1,1800.00,65),(14,'Коррекция стрижки','Подравнивание кончиков, уточнение формы и окантовка. Выполняется для поддержания аккуратного вида между основными стрижками.',1,600.00,20),(15,'Глубокое очищение кожи головы','Процедура с использованием скраба для кожи головы. Удаляет излишки кожного сала, улучшает кровообращение и стимулирует рост волос.',1,700.00,25),(16,'Стрижка с текстурированием','Создание текстуры волос с помощью филировки и градуировки. Придаёт объём и лёгкую небрежность.',1,1400.00,50),(17,'Стрижка с асимметрией','Асимметричная стрижка с разной длиной волос по бокам. Стильный вариант для креативных клиентов.',1,1600.00,55),(18,'Стрижка под ноль (налысо)','Полное удаление волос машинкой. Выполняется с окантовкой висков и шеи.',1,500.00,15),(19,'Экспресс-стрижка (без мытья)','Быстрая стрижка без мытья головы. Подходит для поддержания формы между полноценными процедурами.',1,800.00,30),(20,'Стрижка бороды','Придание формы и длины бороде с учётом пожеланий клиента и особенностей лица. Включает окантовку и выравнивание контуров.',2,800.00,30),(21,'Моделирование бороды','Комплексная работа по созданию индивидуального силуэта бороды. Мастер подбирает форму, подчёркивающую черты лица, и выполняет точную стрижку.',2,1200.00,45),(22,'Оформление контура бороды','Чёткая окантовка линии роста волос на шее и щеках. Придаёт бороде ухоженный вид и аккуратность.',2,500.00,15),(23,'Уход за бородой (маска + масло)','Нанесение питательной маски для бороды с последующим массажем и обработкой специальным маслом. Увлажняет волосы, смягчает кожу под бородой.',2,700.00,25),(24,'Окрашивание бороды','Выравнивание цвета бороды, камуфляж седины или креативное окрашивание. Используется стойкая краска, безопасная для кожи.',2,1500.00,40),(25,'Королевское бритьё опасной бритвой','Многоэтапная процедура: распаривание лица, бритьё опасной бритвой, холодный компресс и уход после бритья. Обеспечивает идеально гладкую кожу.',2,2000.00,60),(26,'Бритьё шейвером','Быстрое и комфортное удаление щетины электрической бритвой. Подходит для ежедневного ухода, минимизирует раздражение.',2,600.00,20),(27,'Коррекция усов','Придание формы усам, подравнивание кончиков и окантовка.',2,400.00,10),(28,'Оформление линии бороды на шее','Чёткое оформление нижней границы бороды с использованием триммера.',2,300.00,10),(29,'Подравнивание бороды триммером','Быстрое подравнивание длины бороды без сложной коррекции формы.',2,400.00,15),(30,'Глубокий уход за бородой','Комплекс: пилинг для кожи под бородой + маска + масло + массаж. Восстанавливает здоровье волос и кожи.',2,1200.00,40),(31,'Восковое моделирование бороды','Фиксация формы бороды с помощью воска для укладки. Создаёт эффект «зачёсанной» бороды.',2,350.00,10),(32,'Удаление волос в носу и ушах триммером','Аккуратное удаление лишних волос в носу и ушах без боли и раздражения.',2,300.00,10),(33,'Контурная стрижка бороды','Точная стрижка с созданием чётких геометрических линий.',2,900.00,35),(34,'Распаривание лица перед бритьём','Глубокое распаривание кожи с помощью горячего полотенца. Открывает поры, смягчает щетину и подготавливает лицо к бритью.',3,300.00,10),(35,'Массаж лица','Расслабляющий массаж лица с использованием питательного крема. Улучшает кровообращение, снимает напряжение и придаёт коже здоровый вид.',3,800.00,20),(36,'Маска для лица (увлажняющая/успокаивающая)','Нанесение профессиональной маски для глубокого увлажнения или успокоения кожи после бритья. Снимает раздражение и восстанавливает баланс.',3,600.00,25),(37,'Пилинг для лица','Очищение кожи от ороговевших клеток с помощью скраба или химического пилинга. Улучшает текстуру кожи, выравнивает тон и стимулирует обновление.',3,900.00,30),(38,'Компресс после бритья','Нанесение успокаивающего лосьона и холодного компресса для снятия раздражения после бритья.',3,400.00,15),(39,'Очищение пор','Глубокое очищение пор с использованием специальных средств. Уменьшает чёрные точки и улучшает состояние кожи.',3,700.00,25),(40,'Увлажнение кожи лица','Нанесение интенсивного увлажняющего крема или сыворотки. Восстанавливает водный баланс кожи.',3,500.00,15),(41,'Антистресс-уход для лица','Комплекс: массаж + маска + увлажнение. Расслабляет, снимает напряжение, улучшает цвет лица.',3,1500.00,45),(42,'Чёрная маска для глубокого очищения','Очищающая маска на основе угля. Вытягивает загрязнения из пор, матирует кожу.',3,800.00,30),(43,'Тонизирование кожи','Нанесение тонизирующего лосьона для восстановления pH-баланса кожи после процедур.',3,200.00,5),(44,'Мужской маникюр (классический)','Обрезной маникюр с обработкой кутикулы, приданием формы ногтям и полировкой. Завершается нанесением увлажняющего крема.',4,1200.00,40),(45,'Педикюр (мужской)','Уход за ногтями и кожей стоп: удаление огрубевшей кожи, обработка ногтей, массаж с кремом. Придаёт ногам ухоженный вид.',4,1800.00,60),(46,'Депиляция воском (нос/уши)','Удаление нежелательных волос в носу и ушах с помощью воска. Обеспечивает длительный эффект и аккуратный внешний вид.',4,500.00,15),(47,'Коррекция бровей (триммер/выщипывание)','Придание бровям аккуратной формы с помощью триммера или пинцета. Включает удаление лишних волос и оформление контура.',4,400.00,15),(48,'Мужской маникюр аппаратный','Аппаратный маникюр без обрезания кутикулы. Более безопасный и щадящий метод.',4,1300.00,45),(49,'Мужской педикюр аппаратный','Аппаратная обработка стоп и ногтей. Меньше травматичен, подходит для чувствительной кожи.',4,2000.00,70),(50,'Комплексный мужской уход (маникюр + педикюр)','Полный уход за руками и ногами: обработка ногтей, кутикулы, кожи стоп, массаж и увлажнение.',4,3000.00,90),(51,'Депиляция воском (грудь/спина)','Удаление волос на груди или спине с помощью воска. Длительный эффект до 3–4 недель.',4,1500.00,45),(52,'Коррекция бровей с окрашиванием','Оформление формы бровей + окрашивание хной или краской. Придаёт выразительность взгляду.',4,700.00,30);
/*!40000 ALTER TABLE `Service` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Service_In_Record`
--

DROP TABLE IF EXISTS `Service_In_Record`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Service_In_Record` (
  `Id_Record` int NOT NULL,
  `Id_Service` int NOT NULL,
  PRIMARY KEY (`Id_Record`,`Id_Service`),
  KEY `Id_Service_idx` (`Id_Service`),
  KEY `Id_Recorrd_idx` (`Id_Record`),
  CONSTRAINT `Id_Recorrd` FOREIGN KEY (`Id_Record`) REFERENCES `Record` (`IdRecord`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `Id_Service` FOREIGN KEY (`Id_Service`) REFERENCES `Service` (`IdService`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Service_In_Record`
--

LOCK TABLES `Service_In_Record` WRITE;
/*!40000 ALTER TABLE `Service_In_Record` DISABLE KEYS */;
INSERT INTO `Service_In_Record` VALUES (1,1),(2,1),(3,2),(7,2),(9,2),(17,2),(18,2),(27,2),(33,2),(37,2),(38,2),(39,2),(45,2),(3,3),(5,3),(6,3),(11,3),(13,3),(20,3),(21,3),(22,3),(23,3),(24,3),(26,3),(28,3),(29,3),(31,3),(34,3),(35,3),(39,3),(40,3),(42,3),(43,3),(44,3),(45,3),(8,4),(15,4),(19,4),(21,4),(30,4),(32,4),(36,4),(40,4),(41,4),(8,5),(13,5),(15,5),(16,5),(19,5),(23,5),(30,5),(31,5),(43,5),(45,5),(2,6),(19,6),(23,6),(12,11),(4,12),(4,13),(8,13),(30,14),(21,15),(25,18),(14,19),(25,19),(38,19),(12,20),(36,20),(10,22),(27,22),(29,22),(6,23),(10,23),(28,23),(32,23),(39,23),(42,23),(10,24),(35,25),(11,26),(34,26),(40,26),(43,26),(22,27),(37,27),(33,28),(44,28),(7,29),(14,29),(37,29),(36,32),(30,33),(17,35),(28,35),(32,35),(45,35),(9,37),(38,37),(24,38),(34,38),(34,39),(29,40),(7,41),(28,41),(30,41),(42,41),(29,42),(44,42),(5,43),(5,44),(11,44),(39,44),(41,44),(26,46),(6,47),(24,47),(27,47),(33,47),(35,47),(26,48),(30,48),(37,48),(18,49),(2,50),(18,50),(26,50),(1,51),(9,51),(20,51),(38,51),(41,51),(20,52),(30,52),(42,52);
/*!40000 ALTER TABLE `Service_In_Record` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Status`
--

DROP TABLE IF EXISTS `Status`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Status` (
  `IdStatus` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(50) NOT NULL,
  `Description` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`IdStatus`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Status`
--

LOCK TABLES `Status` WRITE;
/*!40000 ALTER TABLE `Status` DISABLE KEYS */;
INSERT INTO `Status` VALUES (1,'Ожидается',NULL),(2,'Завершен',NULL);
/*!40000 ALTER TABLE `Status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `User`
--

DROP TABLE IF EXISTS `User`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `User` (
  `IdUser` int NOT NULL AUTO_INCREMENT,
  `Id_Employe` int NOT NULL,
  `Password` varchar(64) NOT NULL,
  `Login` varchar(20) NOT NULL,
  `Id_Role` int NOT NULL,
  PRIMARY KEY (`IdUser`),
  KEY `Id_Role_idx` (`Id_Role`),
  KEY `Id_Emploey_idx` (`Id_Employe`),
  CONSTRAINT `Id_Emploey` FOREIGN KEY (`Id_Employe`) REFERENCES `Employe` (`IdEmploye`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `Id_Role` FOREIGN KEY (`Id_Role`) REFERENCES `Role` (`IdRole`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `User`
--

LOCK TABLES `User` WRITE;
/*!40000 ALTER TABLE `User` DISABLE KEYS */;
INSERT INTO `User` VALUES (1,1,'8C6976E5B5410415BDE908BD4DEE15DFB167A9C873FC4BB8A81F6F2AB448A918','admin',1),(2,2,'6EE4A469CD4E91053847F5D3FCB61DBCC91E8F0EF10BE7748DA4C4A1BA382D17','manager',2),(3,49,'11C27AE42D9214F220EB0918855CBFCDE8767D43D0DB9EFCFC21F018770D2FD6','employe',3),(4,4,'6B86B273FF34FCE19D6B804EFF5A3F5747ADA4EAA22F1D49C01E52DDB7875B4B','loginUserExampl00004',3),(5,5,'6B86B273FF34FCE19D6B804EFF5A3F5747ADA4EAA22F1D49C01E52DDB7875B4B','loginUserExampl00005',3),(6,6,'6B86B273FF34FCE19D6B804EFF5A3F5747ADA4EAA22F1D49C01E52DDB7875B4B','loginUserExampl00006',3);
/*!40000 ALTER TABLE `User` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-13 15:03:55
